/*
Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.
[345, 897, 568, 234] -> 2
*/

int[] CreateArray(int size, int min, int max)
{
    int[] array = new int[size];
    Random rand = new Random();

    for (int i = 0; i < size; i++)
    {
        array[i] = rand.Next(min, max + 1);
    }
    return array;
}

string Print(int[] array)
{
    return string.Join(", ", array);
}

int FindEven(int[] array)
{
    int count = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i] % 2 == 0)
        {
            count++;
        }
    }
    return count;
}

int[] array = CreateArray(5, 100, 998);
System.Console.WriteLine($"Массив [{Print(array)}]");
int even = FindEven(array);
System.Console.WriteLine($"Колличество четных чисел в массиве [{Print(array)}] равно {even}");
