# Задача 3: Вычисление факториала числа. Напишите программу, которая находит факториал заданного числа N с использованием рекурсии или встроенных функций.

from math import factorial

n = int(input("Введите число: "))

print(factorial(n))
