# Задача 7: Поиск подстроки. Напишите программу, которая находит все вхождения заданной подстроки в строке с использованием встроенных функций.

line = input("Введите строку/предложение: ")
x = input("Введите искомое слово/букву: ")

print(x in line)
