# Найдите сумму цифр трехзначного числа n.
n = 123

# res = n // 100 - 1
# res = n // 10 % 10
# res = n % 10 - 3
res = int((n // 100) + (n // 10 % 10) + (n % 10))

print(res)
